#coding:utf-8
'''
文 件 名：_XiaoRGEEK_GLOBAL_variable_.py
功    能：全局变量文件，部分参数可根据需求修改
外部条用：
import _XiaoRGEEK_GLOBAL_variable_ as G_val
G_val.xx
'''
###########################################################
################可手动修改的参数###########################
Radar_distence	= 15		#超声波测距
Cruising_Flag = 0			#当前循环模式，不同标志位进入不同模式，由上位机软件下发不同模式来改变参数。
							# 0:手动控制模式					1:红外跟随模式 Follow()
							# 2:红外巡线模式 TrackLine()		3:红外避障模式 Avoiding()
							# 4:超声波壁障模式AvoidByRadar()	5:超声波测距模式显示Send_Distance()
							# 6:温湿度显示模式DisplayDHT11()	7:路径规划 Route()
							# 8:退出摄像头循迹模式				9：进入摄像头循迹模式Path_Dect()
servo_angle_max = 160		#舵机角度上限值，防止舵机卡死，可设置小于180的数值
servo_angle_min = 15		#舵机角度下限值，防止舵机卡死，可设置大于0的数值
#############摄像头巡线参数设置################
Path_Dect_Flag = 0			#摄像头巡线标志位，0为巡黑线（浅色地面，深色线）；1为巡白线（深色地面，浅色线）





###########################################################
################禁止手动修改的参数#########################
###########################################################
motor_flag = 1				#电机接线组合标志位，默认为1；上位机调整方向后，会下发实际标志位（1-8）
BT_Client = False
TCP_Client = False
socket_flag = 0
#############路径规划参数设置##################
RevStatus = 0				#状态参数
TurnAngle = 0				#运行角度参数
Golength = 0				#运行距离参数
###########上传数据参数设置###################
#sendbuf  = ['\xFF','00','00','00','\xFF']	#FF XX XX XX FF
#sendflag = 0				#发送标志位，0为不发送，1为发送

Path_Dect_on = 0			#摄像头巡线开始标志，0为停止，1为开始执行
Path_Dect_px = 320			#摄像头巡线中心坐标设置
